<a href="https://colab.research.google.com/github/iamnotvk/SnapTravel/blob/main/SnapTravel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install pandasql

In [ ]:
import pandas as pd
import pandasql as ps
from pandasql import sqldf
import string
import re

In [ ]:
data = 'Airline Code;DelayTimes;FlightCodes;To_From\nAir Canada (!);[21, 40];20015.0;WAterLoo_NEWYork\n<Air France> (12);[];;Montreal_TORONTO\n(Porter Airways. );[60, 22, 87];20035.0;CALgary_Ottawa\n12. Air France;[78, 66];;Ottawa_VANcouvER\n""".\\.Lufthansa.\\.""";[12, 33];20055.0;london_MONTreal\n'
splitn = data.split("\n")
df = pd.DataFrame([sub.split(";") for sub in splitn])
#Naming the Columns
df.columns =['Airlines', 'DelayTimes', 'FlightCodes', 'To_From']
df.drop(labels=[0,6],axis=0,inplace=True)

#Removing Unncessary Punctuations from the Airlines Columns
i = 1
for k in df['Airlines']:
  df.at[i,"Airlines"] = (re.sub(r"[^a-zA-Z]+", ' ', k))
  i+=1

#Increment the FlightCodes by 10 and fill all the missing values
i = 1
para = 20015
for k in df['FlightCodes']:
  df.at[i,"FlightCodes"] = para
  i+=1
  para+=10

#Split the To_From Columns using '_' as a delimiter
df[['To','From']] = df.To_From.str.split("_",expand=True,)
df.drop(labels=["To_From"],axis=1,inplace=True)
df = df.rename(columns={'Airlines': 'Airlines1', 'DelayTimes': 'DelayTimes1', 'FlightCodes': 'FlightCodes1', 'To': 'To_', 'From': 'From_'})

i=1
for k in df['To_']:
  df.at[i,"To_"] = df.at[i,"To_"].upper()
  i+=1

i=1
for k in df['From_']:
  df.at[i,"From_"] = df.at[i,"From_"].upper()
  i+=1

display(df)
# SQL Query to retrieve the flights leaving from Waterloo

mysql = lambda q: sqldf(q) 
query = ''' SELECT * FROM df WHERE From_ LIKE '%Waterloo%'; ''' 
mysql(query)

          Airlines1   DelayTimes1 FlightCodes1       To_      From_
1       Air Canada       [21, 40]        20015  WATERLOO    NEWYORK
2       Air France             []        20025  MONTREAL    TORONTO
3   Porter Airways   [60, 22, 87]        20035   CALGARY     OTTAWA
4        Air France      [78, 66]        20045    OTTAWA  VANCOUVER
5        Lufthansa       [12, 33]        20055    LONDON   MONTREAL

Empty DataFrame
Columns: [Airlines1, DelayTimes1, FlightCodes1, To_, From_]
Index: []